[
    {
        "date": "16.03.2024",
        "notifications": [
            {
                "id": "1",
                "title": "আল্লাহর স্মরণ",
                "description": "সুবহানআল্লাহ"
            },
            {
                "id": "2",
                "title": "আল্লাহর স্মরণ",
                "description": "আলহামদুলিল্লাহ্‌"
            }
        ]
    },
    {
        "date": "11.03.2024",
        "notifications": [
            {
                "id": "1",
                "title": "আল্লাহর স্মরণ",
                "description": "রব্বী জিদনি-ইলমা-"
            }
        ]
    },
    {
        "date": "03.03.2024",
        "notifications": [
            {
                "id": "1",
                "title": "আল্লাহর স্মরণ",
                "description": "লা-ইলাহা ইল্লাল্লাহ"
            },
            {
                "id": "2",
                "title": "আল্লাহর স্মরণ",
                "description": "আলাহু আকবার"
            }
        ]
    },
    {
        "date": "04.04.2024",
        "notifications": [
            {
                "id": "1",
                "title": "মাতা-পিতার জন্য সন্তানের দোয়া(সূরা বণী ইসরাইল, আয়াতঃ ২৩-২৫)",
                "description": "রাব্বির হামহুমা কামা রাব্বাঈয়ানী সাগিরা। (হে আল্লাহ্ আমার মাতা-পিতার প্রতি আপনি সেই ভাবে সদয় হউন, তাঁরা শৈশবে আমাকে যেমন স্নেহ-মমতা দিয়ে লালন-পালন করেছেন।)"
            },
            {
                "id": "2",
                "title": " ঈমানের সাথে মৃত্যু বরণ করার দোয়া(সুরা আল ইমরান, আয়াতঃ ০৮)",
                "description": "রাব্বানা লা’তুযিগ কুলুবানা বা’দা ইয হাদাইতানা ওয়া হাবলানা মিল্লাদুনকা রাহমাতান, ইন্নাকা আনতাল ওয়াহাব। (হে আমাদের পালনকর্তা, সরলপথ প্রদর্শনের পর তুমি আমাদের অন্তরকে বক্র করে দিওনা এবং তুমি আমাদের প্রতি করুনা কর, তুমিই মহান দাতা।)"
            },
            {
                "id": "3",
                "title": "ভুল করে ফেললে ক্ষমা চাওয়ার দোয়া",
                "description": "রাব্বাবা যালামনা আনফুসানা ওয়া ইল্লাম তাগফির্লানা ওয়াতার হামনা লানা কুনান্না মিনাল খা’সিরিন। (হে আল্লাহ্, আমি আমার নিজের উপর জুলুম করে ফেলেছি। এখন তুমি যদি ক্ষমা ও রহম না কর, তাহলে আমি ধ্বংস হয়ে যাব।)"
            },
            {
                "id": "4",
                "title": "গুনাহ্ মাফের দোয়া(সূরা আল ইমরান, আয়াতঃ ১৯৩)",
                "description": "রাব্বানা ফাগফিরলানা যুনুবানা ওয়া কাফফির আন্না সাইয়্যিআতিনা ওয়া তাওয়াফ্ফানা মায়াল আবরার।(হে আমাদের পালনকর্তা, আমাদের গুনাহসমূহ মাফ করে দাও, আমাদের থেকে সকল মন্দ দূর করে দাও এবং আমাদের নেক লোকদের সাহচার্য দান কর।)"
            },
            {
                "id": "5",
                "title": "স্বামী-স্ত্রী-সন্তানদের জন্য দোয়া(সূরা আল ফুরকান, আয়াতঃ ৭৪)",
                "description": "رَبَّنَا هَبۡ لَـنَا مِنۡ اَزۡوَاجِنَا وَذُرِّيّٰتِنَا قُرَّةَ اَعۡيُنٍ وَّاجۡعَلۡنَا لِلۡمُتَّقِيۡنَ اِمَامًا (হে আমাদের পালনকর্তা, আমাদিগকে আমাদের স্ত্রী ও সন্তান-সন্ততিগণ হতে নয়নের তৃপ্তি দান কর এবং আমাদেরকে মুত্তাকীদের নেতা বানাও।)"
            },
            {
                "id": "6",
                "title": "ঈমান ঠিক রাখার আমল",
                "description": "ইয়া মুক্বাল্লিবাল কুলুবি ছাব্বিত ক্বালবি আলা দ্বীনিকা। (হে মনের গতি পরিবর্তনকারী, আমার মনকে সত্য দ্বীনের উপর স্থিত কর।)"
            },
            {
                "id": "7",
                "title": "নেক সন্তানদের জন্য দোয়া",
                "description": "রাব্বি হাবলি মিনাস সালেহীন। (হে আমার পালনকর্তা, আমাকে নেককার সৎ-কর্মশীল সন্তান দান কর।)"
            },
            {
                "id": "8",
                "title": "অবাধ্য সন্তান বাধ্য করার দোয়া(সূরা আহকাফ, আয়াতঃ ১৫)",
                "description": "ওয়াছলিহলি ফী যুররিইয়াতি, ইন্নি তুবতু ইলাইকা, ওয়া ইন্নি মিনাল মুসলিমীন। (আমার জন্য আমার সন্তানদের মধ্যে প্রীতি দান কর, অবশ্যই আমি তোমারই দিকে ফিরিতেছি এবং অবশ্যই আমি মুসলমানদের অন্তর্ভূক্ত।)"
            },
            {
                "id": "9",
                "title": "ক্ষমা ও রহমতের দোয়া",
                "description": "রাব্বিগ ফির ওয়ারহাম ওয়া আনতা খাইরুর রাহিমীন।(হে আল্লাহ্, আমাকে ক্ষমা করে দাও, আর আমার প্রতি রহম কর, তুমিই তো উত্তম দয়ালু।)"
            },
            {
                "id": "10",
                "title": "কাফেরদের বিরুদ্ধে বিজয়ী হওয়ার দোয়া(সূরা আল ইমরান, আয়াতঃ ১৪৭)",
                "description": "রাব্বানাগ ফিরলানা যুনুবানা ওয়া ইসরাফানা ফী আমরিনা ওয়া ছাব্বিত আক্কদামানা ওয়ানছুরনা আলাল কাওমিল ক্বাফিরীন। (হে আমাদের পালনকর্তা, আমাদের গুনাহ এবং কোন কাজের সীমা লঙ্ঘনকে তুমি ক্ষমা কর, আমাদের ঈমান দৃঢ় রাখ এবং কাফেরদের বিরুদ্ধে আমাদের বিজয়ী কর।)"
            },
            {
                "id": "11",
                "title": "ঘুমানোর আগের দোয়া",
                "description": "اَللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا(হে আল্লাহ! আমি তোমারই নামে ঘুমাই এবং তোমার নামেই জাগ্রত হই।)"
            },
            {
                "id": "12",
                "title": "ঘুম থেকে জেগে উঠার সময়ের দোয়া",
                "description": "أَلْحَمْدُ لِلّٰهِ الَّذِيْ أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُوْرُ (হামদ-প্রশংসা আল্লাহ্‌র জন্য, যিনি (নিদ্রারূপ) মৃত্যুর পর আমাদেরকে জীবিত করলেন, আর তাঁরই নিকট সকলের পুনরুত্থান)"
            },
            {
                "id": "13",
                "title": "লাইলাতুল ক্বদরের দোআ",
                "description": "اَللّٰهُمَّ إِنَّكَ عَفُوٌّ(كَرِيْمٌ) تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّيْ (হে আল্লাহ, আপনি ক্ষমাশীল (উদার), আপনি ক্ষমা করতে ভালবাসেন, আপনি আমাকে ক্ষমা করুন।)"
            },
            {
                "id": "14",
                "title": "কাফেরদের বিরুদ্ধে বিজয়ী হওয়ার দোয়া(সূরা আল ইমরান, আয়াতঃ ১৪৭)",
                "description": "রাব্বানাগ ফিরলানা যুনুবানা ওয়া ইসরাফানা ফী আমরিনা ওয়া ছাব্বিত আক্কদামানা ওয়ানছুরনা আলাল কাওমিল ক্বাফিরীন। (হে আমাদের পালনকর্তা, আমাদের গুনাহ এবং কোন কাজের সীমা লঙ্ঘনকে তুমি ক্ষমা কর, আমাদের ঈমান দৃঢ় রাখ এবং কাফেরদের বিরুদ্ধে আমাদের বিজয়ী কর।)"
            },
            {
                "id": "15",
                "title": "স্ত্রী-সহবাসের পুর্বের দো‘আ",
                "description": "بِسْمِ اللّٰهِ اَللّٰهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا (আল্লাহর নামে, হে আল্লাহ, আমাদেরকে শয়তান থেকে দূরে রাখুন এবং আমাদের যা রিযক দিবেন তা থেকে শয়তানকে দূরে রাখুন।)"
            },
            {
                "id": "16",
                "title": "সুসন্তান লাভের জন্য দোয়া [৩:৩৮]",
                "description": "رَبِّ هَبۡ لِىۡ مِنۡ لَّدُنۡكَ ذُرِّيَّةً طَيِّبَةً‌ ۚاِنَّكَ سَمِيۡعُ الدُّعَآءِ (হে আমার রব, আমাকে আপনার পক্ষ থেকে উত্তম সন্তান দান করুন। নিশ্চয় আপনি প্রার্থনা শ্রবণকারী।)"
            },
            {
                "id": "17",
                "title": "পানি পান করার পর দোয়া",
                "description": "الْحَمْدُ لِلَّهِ الَّذِي سَقَانَا مَاءً عَذْبًا فُرَاتًا بِرَحْمَتِهِ، وَلَمْ يَجْعَلْهُ مِلْحًا أُجَاجًا بِذُنُوبِنَا (সকল প্রশংসা আল্লাহ তা’আলার জন্যে, যিনি আমাদেরকে স্বীয় রহমতে সুস্বাদু, সুমিষ্ট পানি পান করিয়েছেন এবং আমাদের গুনাহের কারণে তা তিক্ত ও লবণাক্ত করেননি।)"
            }
        ]
    }
]
